Revit 2024 API
EnergyDataSettings.CheckProjectReportType Method
 Checks that the project report type falls within an appropriate range.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static bool CheckProjectReportType(
	HVACLoadLoadsReportType projectReportType
)
Visual Basic
Public Shared Function CheckProjectReportType ( _
	projectReportType As HVACLoadLoadsReportType _
) As Boolean
Visual C++
public:
static bool CheckProjectReportType(
	HVACLoadLoadsReportType projectReportType
)
Parameters
projectReportType
Type: Autodesk.Revit.DB.Analysis.HVACLoadLoadsReportType
 The project report type to be checked.
Return Value
 True if the project report type falls within an appropriate range, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace